# a
a = "виведіть третій символ цього рядка"
print(a[2])

# b
b = "виведіть передостанній символ цього рядка"
print(b[-2])

# c
c = "виведіть перші п'ять символів цього рядка"
print(c[:5])

# d
d = "виведіть весь рядок, крім двох останніх символів"
print(d[:-2])

# e
e = "виведіть усі символи з парними індексами"
print(e[::2])

# f
f = "виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка"
print(f[1::2])

# g
g = "виведіть усі символи у зворотному порядку"
print(g[::-1])

# h
h = "виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього"
print(h[::-2])

# i
i = "виведіть довжину цього рядка"
print(i.__len__())

#######################################################################################

stage_2 = " Дано рядок, що складається зі слів, розділених пробілами. Визначте, скільки у ній слів"
a = stage_2.count(" ")
print(a)

#######################################################################################
s = input()
ch = input()

index = False

while True:

    index = s.find(ch, index + 1)
    if index == -1:
        break

    print(index)
####################################################################################################
my_str = "Замініть у цьому рядку всі появи літери"
letter = my_str.replace("і", "І", 3)
print(letter)
